// jshint ignore: start
'use strict';


angular.module('arabicApp')
  .controller('ExercisesCtrl', ['$scope','arabicProvider', function ($scope,arabicProvider) {

    $scope.exercises = {};
    $scope.readings = {};

    $scope.readings.Passages = [{
      "unit": 1,
      "title": 'ابن بطوطة و رحلة في التاريخ',
      "content": 'هو ابن بطوطة محمد اللواتي الذي يشتهر باسم ابن بطوطة، ولد سنة ٧٠٣ ه ١٣٠٤  م'
      + 'بدا اطول رحلة قام بها رحالة في العصور الوصطى' +
        'يبلغ طولها ٧٥ الف ميل، اي ثلاثة اضعفف ما قطعة الرحلة الاطالي ماركوبولو'+
        'وتنقل في افريقيا واسيا اطراف اوروبا، زار خلالها ٤٤ بلد، استغرقت رحلته '+
        '٢٩ عاما تزوج فيه ٢٣ مرة، وانجب سبعين ولدا بنتا'+
        'خرج ابن بطوطة من بلدته طنجة قاصدا الحج عاد الى فاس بالغرب وقد بلغ عمره الخمسين عاما و عاش  حتى ' +
      'الثلثة و السبعين  يعيش جلال رحلته بين الناس  يرحل مع القوافل وقيم في الزوايا ' +
      'ويزور اهل العلم ، ويتبرك بلاوليا؛، ' +
      'يجتمع بالصوقية ويقضي ايامه متجولا في الاسولق.' +
      'امتدت رحلته من المحيط الاطلسي غربا الى بحر الصين شرقا،' +
      'وصدرت رحلاته في كتاب تحفة الانظار في غراءب' +
      'الامصار وعجاءب' +
      'الاسفار' +
      'وحفظ لنا ابن بطوطة في كتابه حقاءق' +
      'و معارف لو لاه لمحاها الزمن،فلم يترك لنا اي' +
      'غربي في العصور الوصطى مثل ذلك التراث الواسع الذي' +
      'تركه لنا ابن بطوطة عن اوصاف واحوال البلاد اللتي زارها.' +
      'ويعتبر ابن بطوطة صاحب الفضل الاول في استكشاف بعض المناطق الافرقيا جنوب غرب الصحراء' +
      'واهمها مالي و مدينة تنبكتو، و هو يقدم معلومات اضافية عن احوال' +
      'شعوبها، و لم يستطع الاوروبيون الوصول الى تلك المنطقة قبل اواخر القرن الثامن عسر' +
      '،على يد الرحالة البريطاني منجوبارك والرحالة الفرنسي رينيه كاييه' +
      'ويسجل ابن بطوطة في رحلته ان اعظم منظر وقعت عليه عيناه' +
      'منذ خروجه من طنجة كان القاهرة التي زارها في عصور المماليك البرجية' +
      '،هي مقر الخلافة الاسلامية ايام السلطان ناصر بن قلاوون ويقول عنها انها اعطم حواضر الاسلام' +
      'واهتم المستشرقون منذ اواءل االقرن الماضي برحلة ابن بطوطة،' +
      'فنشرت منها اجزاء، ثم نشرت الرحلة  بعدها بالكامل في' +
      'ترجمة فرنسية سنة ١٨٥٩ ، وطبعت في القاهرة ر بيروت عدة طبعات، ثم ترجمت الى الالمانية سنة ١٩١١'

    }];

    $scope.exercises.quizQuestions =
      [{
        "question": "ما كان ابن بطوطة",
        "option1": "رحالة",
        "option2": "دكتور",
        "option3": "عصكري",
        "correct" : "1"
      }];

    console.log(arabicProvider.convertNumberToArabic(321));

  }]);
